{
  "date": "2025-09-19",
  "title": "Nu är vi igång!",
  "content": "Den första veckan av vårt projekt har varit både intensiv och lärorik. Vi har lagt grunden för arbetet och redan hunnit ta flera viktiga steg mot att förstå vad vi ska bygga och hur vi ska göra det.\n\nVeckan började med ett initialt möte där vi gick igenom projektets upplägg, skrev på vårt projektkontrakt och fördelade roller inom gruppen. Därefter följde ett internt planeringsmöte där vi förberedde oss inför första träffen med projektägarna. Vi diskuterade vilka frågor vi behövde svar på, vad vi behövde veta om projektets mål och vilka beslut som ska vara fattade inom de kommande veckorna, bland annat kring systemarkitektur och tekniska val.\n\nUnder veckan hade vi också vårt första möte med projektägarna – lektorer och professorer vid LTU som är en del av samarbetet Predictive Movement 3. Från mötet tog vi med oss tre centrala riktlinjer: systemet ska fungera som ett överflödessystem där transporter kan matchas med ledig kapacitet, ett automatiserat omdömessystem behövs för att skapa tillit mellan aktörerna, och målet är att kunna testa lösningen i en pilot i Norrbotten mot slutet av året.\n\nEfteråt höll vi ytterligare gruppmöten där vi diskuterade tekniska val. Vi presenterade den här projektsidan och resonerade kring frameworks som Hyperledger Fabric och Firefly för en möjlig blockchain-implementation. Vi beslutade att TypeScript blir vårt huvudspråk, men att Go kan komma att användas vid behov.\n\nI vårt andra möte med projektägarna diskuterade vi nätverksarkitekturen, bland annat med hjälp av Merkle-träd. Vi fick också feedback kring hur konflikter mellan aktörer kan hanteras med både positiva och negativa bevis kopplade till leveranser.\n\nVeckan avslutades med att vi delade upp oss i två forskningsgrupper – en som fördjupar sig i Accumulate (ankring av bevis till Bitcoin/Ethereum) och en som undersöker Hyperledger Fabric och möjliga lösningar med NFTs.\n\nSammanfattningsvis har vi haft en stark start. Vi ser fram emot att fortsätta arbetet, lära oss mer och börja forma den digitala plattformen på riktigt.",
  "summary": "Den första veckan av vårt projekt har varit både intensiv och lärorik. Vi har lagt grunden för arbetet och redan hunnit ta flera viktiga steg mot att förstå vad vi ska bygga och hur vi ska göra det..."
}
